var width = $(window).width();

$('.navbar .nav-link').click(function () {
  //手機版 nav click 收合
  if($(window).innerWidth() <= 820) {
    $('.navbar-toggler').trigger('click');
  }
});

const hospitals = [
  {
    "id": 1,
    "name": "長庚醫療財團法人高雄長庚紀念醫院",
    "phone": "07-7317123",
    "address": "高雄市鳥松區大埤路123號",
    "city": "高雄市",
    "town": "鳥松區",
    "info": "瓣膜性心臟病-瓣膜修補、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 2,
    "name": "振興醫療財團法人振興醫院",
    "phone": "02-28264400",
    "address": "台北市北投區振興街45號",
    "city": "台北市",
    "town": "北投區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 3,
    "name": "高雄榮民總醫院",
    "phone": "07-3422121",
    "address": "高雄市左營區大中一路386號",
    "city": "高雄市",
    "town": "左營區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 4,
    "name": "新光醫療財團法人新光吳火獅紀念醫院",
    "phone": "02-28332211",
    "address": "台北市士林區文昌路95號及士商路51號1至7樓53、55號",
    "city": "台北市",
    "town": "士林區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 5,
    "name": "中國醫藥大學附設醫院",
    "phone": "04-22062121",
    "address": "台中市北區育德路2號",
    "city": "台中市",
    "town": "北區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 6,
    "name": "臺北榮民總醫院",
    "phone": "02-28712121",
    "address": "台北市北投區石牌路2段201號",
    "city": "台北市",
    "town": "北投區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 7,
    "name": "醫療財團法人徐元智先生醫藥基金會亞東紀念醫院",
    "phone": "02-89667000",
    "address": "新北市板橋區南雅南路2段21號及高爾富路300號",
    "city": "新北市",
    "town": "板橋區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 8,
    "name": "國立臺灣大學醫學院附設醫院",
    "phone": "02-23123456",
    "address": "台北市中正區中山南路7、8號；常德街1號",
    "city": "台北市",
    "town": "中正區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 9,
    "name": "長庚醫療財團法人林口長庚紀念醫院",
    "phone": "03-3281200",
    "address": "桃園市龜山區公西里復興街5號、5之7號、文化一路15號",
    "city": "桃園市",
    "town": "龜山區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 10,
    "name": "國立成功大學醫學院附設醫院",
    "phone": "06-2353535",
    "address": "台南市北區勝利路138號",
    "city": "台南市",
    "town": "北區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 11,
    "name": "行天宮醫療志業醫療財團法人恩主公醫院",
    "phone": "02-26723456",
    "address": "新北市三峽區復興路399號、中山路198、258號",
    "city": "新北市",
    "town": "三峽區",
    "info": "冠狀動脈心臟病-支架手術"
  },
  {
    "id": 12,
    "name": "秀傳醫療社團法人秀傳紀念醫院-總院",
    "phone": "04-7256166",
    "address": "彰化縣彰化市南瑤里中山路1段542號",
    "city": "彰化縣",
    "town": "彰化市",
    "info": "冠狀動脈心臟病-支架手術"
  },
  {
    "id": 13,
    "name": "佛教慈濟醫療財團法人花蓮慈濟醫院",
    "phone": "03-8561825",
    "address": "花蓮縣花蓮市中央路3段707號",
    "city": "花蓮縣",
    "town": "花蓮市",
    "info": "冠狀動脈心臟病-支架手術"
  },
  {
    "id": 14,
    "name": "臺中榮民總醫院",
    "phone": "04-23592525",
    "address": "台中市西屯區台灣大道4段 1650號",
    "city": "台中市",
    "town": "西屯區",
    "info": "心律不整-電燒術、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 15,
    "name": "國立臺灣大學醫學院附設醫院雲林分院",
    "phone": "05-5323911",
    "address": "雲林縣斗六市雲林路二段579號",
    "city": "雲林縣",
    "town": "斗六市",
    "info": "冠狀動脈心臟病-支架手術"
  },
  {
    "id": 16,
    "name": "三軍總醫院附設民眾診療服務處-汀洲院區",
    "phone": "02-23659055",
    "address": "台北市中正區汀州路三段40號",
    "city": "台北市",
    "town": "中正區",
    "info": "周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 17,
    "name": "屏基醫療財團法人屏東基督教醫院",
    "phone": "08-7368686",
    "address": "屏東縣屏東市華山里大連路60號",
    "city": "屏東縣",
    "town": "屏東市",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 18,
    "name": "臺北市立聯合醫院-中興院區",
    "phone": "02-25523234",
    "address": "台北市大同區鄭州路145號",
    "city": "台北市",
    "town": "大同區",
    "info": "心律不整-去顫器、節律器置放手術、冠狀動脈心臟病-支架手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 19,
    "name": "中山醫學大學附設醫院-大慶總院",
    "phone": "04-24739595",
    "address": "台中市南區建國北路一段110號",
    "city": "台中市",
    "town": "南區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 20,
    "name": "國泰醫療財團法人國泰綜合醫院",
    "phone": "02-27082121",
    "address": "台北市大安區仁愛路4段280號，266巷6號",
    "city": "台北市",
    "town": "大安區",
    "info": "心律不整-去顫器、節律器置放手術、瓣膜性心臟病-主動脈瓣膜支架置放,冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 21,
    "name": "台灣基督長老教會馬偕醫療財團法人馬偕紀念醫院",
    "phone": "02-25433535",
    "address": "台北市中山區中山北路2段92號",
    "city": "台北市",
    "town": "中山區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術"
  },
  {
    "id": 22,
    "name": "國立臺灣大學醫學院附設醫院新竹分院",
    "phone": "03-5326151",
    "address": "新竹市北區金華里經國路一段442巷25號",
    "city": "新竹市",
    "town": "北區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、周邊動脈疾病-氣球擴張支架置放、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術"
  },
  {
    "id": 23,
    "name": "奇美醫療財團法人奇美醫院",
    "phone": "06-2812811",
    "address": "台南市永康區中華路901號、台南市南區樹林街二段442號",
    "city": "台南市",
    "town": "永康區",
    "info": "主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術、冠狀動脈心臟病-支架手術"
  },
  {
    "id": 24,
    "name": "財團法人私立高雄醫學大學附設中和紀念醫院",
    "phone": "07-3121101",
    "address": "高雄市三民區十全一路100號",
    "city": "高雄市",
    "town": "三民區",
    "info": "周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術"
  },
  {
    "id": 25,
    "name": "長庚醫療財團法人高雄長庚紀念醫院",
    "phone": "07-7317123",
    "address": "高雄市鳥松區大埤路123號",
    "city": "高雄市",
    "town": "鳥松區",
    "info": "心律不整-電燒術、心律不整-去顫器、節律器置放手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術"
  },
  {
    "id": 26,
    "name": "衛生福利部雙和醫院",
    "phone": "02-22490088",
    "address": "新北市中和區中正路291號",
    "city": "新北市",
    "town": "中和區",
    "info": "冠狀動脈心臟病-繞道手術"
  },
  {
    "id": 27,
    "name": "佛教慈濟醫療財團法人花蓮慈濟醫院",
    "phone": "03-8561825",
    "address": "花蓮縣花蓮市中央路3段707號",
    "city": "花蓮縣",
    "town": "花蓮市",
    "info": "心律不整-電燒術、周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術、冠狀動脈心臟病-繞道手術"
  },
  {
    "id": 28,
    "name": "佛教慈濟醫療財團法人台北慈濟醫院",
    "phone": "02-66289779",
    "address": "新北市新店區建國路289號",
    "city": "新北市",
    "town": "新店區",
    "info": "周邊動脈疾病-氣球擴張支架置放、瓣膜性心臟病-主動脈瓣二尖脈瓣置換、冠狀動脈心臟病-繞道手術"
  },
  {
    "id": 29,
    "name": "彰化基督教醫療財團法人彰化基督教醫院",
    "phone": "04-7238595",
    "address": "彰化縣彰化市南校街135號、中華路176號、旭光路235、320號",
    "city": "彰化縣",
    "town": "彰化市",
    "info": "心律不整-電燒術、主動脈疾病-主動脈手術、瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣二尖脈瓣置換"
  },
  {
    "id": 30,
    "name": "長庚醫療財團法人嘉義長庚紀念醫院",
    "phone": "05-3621000",
    "address": "嘉義縣朴子市仁和里長庚一路6號及嘉朴路西段8號",
    "city": "嘉義縣",
    "town": "朴子市",
    "info": "心律不整-電燒術、主動脈疾病-主動脈手術、瓣膜性心臟病-主動脈瓣二尖脈瓣置換"
  },
  {
    "id": 31,
    "name": "佛教慈濟醫療財團法人台中慈濟醫院",
    "phone": "04-36060666",
    "address": "台中市潭子區豐興路1段66、88號",
    "city": "台中市",
    "town": "潭子區",
    "info": "瓣膜性心臟病-瓣膜修補、瓣膜性心臟病-主動脈瓣二尖脈瓣置換"
  },
  {
    "id": 32,
    "name": "臺灣基督教門諾會醫療財團法人門諾醫院",
    "phone": "03-8241234",
    "address": "花蓮縣花蓮市民權路44號",
    "city": "花蓮縣",
    "town": "花蓮市",
    "info": "瓣膜性心臟病-瓣膜修補"
  },
  {
    "id": 33,
    "name": "臺北市立萬芳醫院",
    "phone": "02-29307930",
    "address": "台北市文山區興隆路3段111號",
    "city": "台北市",
    "town": "文山區",
    "info": "心律不整-電燒術、主動脈疾病-主動脈手術"
  },
  {
    "id": 34,
    "name": "臺南市立安南醫院",
    "phone": "06-3553111",
    "address": "台南市安南區長和路二段66號",
    "city": "台南市",
    "town": "安南區",
    "info": "周邊動脈疾病-氣球擴張支架置放、主動脈疾病-主動脈手術"
  },
  {
    "id": 35,
    "name": "博仁綜合醫院",
    "phone": "02-25786677",
    "address": "台北市松山區光復北路66、68號",
    "city": "台北市",
    "town": "松山區",
    "info": "周邊動脈疾病-氣球擴張支架置放"
  },
  {
    "id": 36,
    "name": "戴德森醫療財團法人嘉義基督教醫院",
    "phone": "05-2765041",
    "address": "嘉義市東區中庄里忠孝路539號、642號、保健街100號",
    "city": "嘉義市",
    "town": "東區",
    "info": "周邊動脈疾病-氣球擴張支架置放"
  },
  {
    "id": 37,
    "name": "東元醫療社團法人東元綜合醫院",
    "phone": "03-5527000",
    "address": "新竹縣竹北市縣政二路69號",
    "city": "新竹縣",
    "town": "竹北市",
    "info": "周邊動脈疾病-氣球擴張支架置放"
  },
  {
    "id": 38,
    "name": "聯新國際醫院",
    "phone": "03-4941234",
    "address": "桃園市平鎮區廣泰路77號、延平路二段430巷115號",
    "city": "桃園市",
    "town": "平鎮區",
    "info": "周邊動脈疾病-氣球擴張支架置放"
  },
  {
    "id": 39,
    "name": "長庚醫療財團法人基隆長庚紀念醫院",
    "phone": "02-24313131",
    "address": "基隆市安樂區麥金路222號、基隆市麥金路201號",
    "city": "基隆市",
    "town": "安樂區",
    "info": "心律不整-電燒術"
  },
  {
    "id": 40,
    "name": "臺北醫學大學附設醫院",
    "phone": "02-27372181",
    "address": "台北市信義區吳興街252號、250號",
    "city": "台北市",
    "town": "信義區",
    "info": "心律不整-去顫器、節律器置放手術"
  },
  {
    "id": 41,
    "name": "台灣基督長老教會馬偕醫療財團法人台東馬偕紀念醫院",
    "phone": "089-310150",
    "address": "台東縣台東市長沙街303巷1號",
    "city": "台東縣",
    "town": "台東市",
    "info": "心律不整-去顫器、節律器置放手術"
  },
  {
    "id": 42,
    "name": "臺北市立聯合醫院-和平婦幼院區",
    "phone": "02-23889595",
    "address": "台北市中正區中華路二段33號",
    "city": "台北市",
    "town": "中正區",
    "info": "心律不整-去顫器、節律器置放手術"
  },
  {
    "id": 43,
    "name": "臺北市立聯合醫院-仁愛院區",
    "phone": "02-27093600",
    "address": "台北市大安區仁愛路四段10號",
    "city": "台北市",
    "town": "大安區",
    "info": "心律不整-去顫器、節律器置放手術"
  },
  {
    "id": 44,
    "name": "臺北市立聯合醫院-忠孝院區",
    "phone": "02-28353456",
    "address": "台北市士林區雨聲街105號",
    "city": "台北市",
    "town": "士林區",
    "info": "心律不整-去顫器、節律器置放手術"
  },
  {
    "id": 45,
    "name": "臺北市立聯合醫院-陽明院區",
    "phone": "02-27861288",
    "address": "台北市南港區同德路87號",
    "city": "台北市",
    "town": "南港區",
    "info": "心律不整-去顫器、節律器置放手術"
  }
];

const cities = {
  "台北市": {
    "name": "台北市",
    "districts": [
      "中山區",
      "中正區",
      "信義區",
      "內湖區",
      "北投區",
      "南港區",
      "士林區",
      "大同區",
      "大安區",
      "文山區",
      "松山區",
      "萬華區"
    ]
  },
  "新北市": {
    "name": "新北市",
    "districts": [
      "三峽區",
      "三芝區",
      "三重區",
      "中和區",
      "五股區",
      "八里區",
      "土城區",
      "坪林區",
      "平溪區",
      "新店區",
      "新莊區",
      "板橋區",
      "林口區",
      "樹林區",
      "永和區",
      "汐止區",
      "泰山區",
      "淡水區",
      "深坑區",
      "烏來區",
      "瑞芳區",
      "石碇區",
      "石門區",
      "萬里區",
      "蘆洲區",
      "貢寮區",
      "金山區",
      "雙溪區",
      "鶯歌區"
    ]
  },
  "桃園市": {
    "name": "桃園市",
    "districts": [
      "中壢區",
      "八德區",
      "大園區",
      "大溪區",
      "平鎮區",
      "復興區",
      "新屋區",
      "桃園區",
      "楊梅區",
      "蘆竹區",
      "觀音區",
      "龍潭區",
      "龜山區"
    ]
  },
  "台中市": {
    "name": "台中市",
    "districts": [
      "中區",
      "北區",
      "北屯區",
      "南區",
      "南屯區",
      "后里區",
      "和平區",
      "外埔區",
      "大安區",
      "大甲區",
      "大肚區",
      "大里區",
      "大雅區",
      "太平區",
      "新社區",
      "東勢區",
      "東區",
      "梧棲區",
      "沙鹿區",
      "清水區",
      "潭子區",
      "烏日區",
      "石岡區",
      "神岡區",
      "西區",
      "西屯區",
      "豐原區",
      "霧峰區",
      "龍井區"
    ]
  },
  "台南市": {
    "name": "台南市",
    "districts": [
      "七股區",
      "下營區",
      "中西區",
      "仁德區",
      "佳里區",
      "六甲區",
      "北區",
      "北門區",
      "南化區",
      "南區",
      "善化區",
      "大內區",
      "學甲區",
      "安南區",
      "安定區",
      "安平區",
      "官田區",
      "將軍區",
      "山上區",
      "左鎮區",
      "後壁區",
      "新化區",
      "新市區",
      "新營區",
      "東區",
      "東山區",
      "柳營區",
      "楠西區",
      "歸仁區",
      "永康區",
      "玉井區",
      "白河區",
      "西港區",
      "關廟區",
      "鹽水區",
      "麻豆區",
      "龍崎區"
    ]
  },
  "高雄市": {
    "name": "高雄市",
    "districts": [
      "三民區",
      "仁武區",
      "內門區",
      "六龜區",
      "前金區",
      "前鎮區",
      "大寮區",
      "大樹區",
      "大社區",
      "小港區",
      "岡山區",
      "左營區",
      "彌陀區",
      "新興區",
      "旗山區",
      "旗津區",
      "杉林區",
      "林園區",
      "桃源區",
      "梓官區",
      "楠梓區",
      "橋頭區",
      "永安區",
      "湖內區",
      "燕巢區",
      "田寮區",
      "甲仙區",
      "美濃區",
      "苓雅區",
      "茂林區",
      "茄萣區",
      "路竹區",
      "那瑪夏區",
      "阿蓮區",
      "鳥松區",
      "鳳山區",
      "鹽埕區",
      "鼓山區"
    ]
  },
  "基隆市": {
    "name": "基隆市",
    "districts": [
      "七堵區",
      "中山區",
      "中正區",
      "仁愛區",
      "信義區",
      "安樂區",
      "暖暖區"
    ]
  },
  "新竹市": {
    "name": "新竹市",
    "districts": [
      "北區",
      "東區",
      "香山區"
    ]
  },
  "嘉義市": {
    "name": "嘉義市",
    "districts": [
      "東區",
      "西區"
    ]
  },
  "新竹縣": {
    "name": "新竹縣",
    "districts": [
      "五峰鄉",
      "北埔鄉",
      "寶山鄉",
      "尖石鄉",
      "峨眉鄉",
      "新埔鎮",
      "新豐鄉",
      "橫山鄉",
      "湖口鄉",
      "竹北市",
      "竹東鎮",
      "芎林鄉",
      "關西鎮"
    ]
  },
  "苗栗縣": {
    "name": "苗栗縣",
    "districts": [
      "三灣鄉",
      "三義鄉",
      "公館鄉",
      "卓蘭鎮",
      "南庄鄉",
      "大湖鄉",
      "後龍鎮",
      "泰安鄉",
      "獅潭鄉",
      "竹南鎮",
      "苑裡鎮",
      "苗栗市",
      "西湖鄉",
      "通霄鎮",
      "造橋鄉",
      "銅鑼鄉",
      "頭份市",
      "頭屋鄉"
    ]
  },
  "彰化縣": {
    "name": "彰化縣",
    "districts": [
      "二林鎮",
      "二水鄉",
      "伸港鄉",
      "北斗鎮",
      "和美鎮",
      "員林市",
      "埔心鄉",
      "埔鹽鄉",
      "埤頭鄉",
      "大城鄉",
      "大村鄉",
      "彰化市",
      "永靖鄉",
      "溪州鄉",
      "溪湖鎮",
      "田中鎮",
      "田尾鄉",
      "社頭鄉",
      "福興鄉",
      "秀水鄉",
      "竹塘鄉",
      "線西鄉",
      "芬園鄉",
      "花壇鄉",
      "芳苑鄉",
      "鹿港鎮"
    ]
  },
  "南投縣": {
    "name": "南投縣",
    "districts": [
      "中寮鄉",
      "仁愛鄉",
      "信義鄉",
      "南投市",
      "名間鄉",
      "國姓鄉",
      "埔里鎮",
      "水里鄉",
      "竹山鎮",
      "草屯鎮",
      "集集鎮",
      "魚池鄉",
      "鹿谷鄉"
    ]
  },
  "雲林縣": {
    "name": "雲林縣",
    "districts": [
      "二崙鄉",
      "元長鄉",
      "北港鎮",
      "口湖鄉",
      "古坑鄉",
      "台西鄉",
      "四湖鄉",
      "土庫鎮",
      "大埤鄉",
      "崙背鄉",
      "斗六市",
      "斗南鎮",
      "東勢鄉",
      "林內鄉",
      "水林鄉",
      "莿桐鄉",
      "虎尾鎮",
      "褒忠鄉",
      "西螺鎮",
      "麥寮鄉"
    ]
  },
  "嘉義縣": {
    "name": "嘉義縣",
    "districts": [
      "中埔鄉",
      "六腳鄉",
      "大埔鄉",
      "大林鎮",
      "太保市",
      "布袋鎮",
      "新港鄉",
      "朴子市",
      "東石鄉",
      "梅山鄉",
      "民雄鄉",
      "水上鄉",
      "溪口鄉",
      "番路鄉",
      "竹崎鄉",
      "義竹鄉",
      "阿里山鄉",
      "鹿草鄉"
    ]
  },
  "屏東縣": {
    "name": "屏東縣",
    "districts": [
      "三地門鄉",
      "九如鄉",
      "佳冬鄉",
      "來義鄉",
      "內埔鄉",
      "南州鄉",
      "屏東市",
      "崁頂鄉",
      "恆春鎮",
      "新園鄉",
      "新埤鄉",
      "春日鄉",
      "東港鎮",
      "枋寮鄉",
      "枋山鄉",
      "林邊鄉",
      "泰武鄉",
      "滿州鄉",
      "潮州鎮",
      "牡丹鄉",
      "獅子鄉",
      "琉球鄉",
      "瑪家鄉",
      "竹田鄉",
      "萬丹鄉",
      "萬巒鄉",
      "車城鄉",
      "里港鄉",
      "長治鄉",
      "霧台鄉",
      "高樹鄉",
      "鹽埔鄉",
      "麟洛鄉"
    ]
  },
  "宜蘭縣": {
    "name": "宜蘭縣",
    "districts": [
      "三星鄉",
      "五結鄉",
      "冬山鄉",
      "南澳鄉",
      "員山鄉",
      "壯圍鄉",
      "大同鄉",
      "宜蘭市",
      "礁溪鄉",
      "羅東鎮",
      "蘇澳鎮",
      "釣魚台列嶼",
      "頭城鎮"
    ]
  },
  "花蓮縣": {
    "name": "花蓮縣",
    "districts": [
      "光復鄉",
      "卓溪鄉",
      "吉安鄉",
      "壽豐鄉",
      "富里鄉",
      "新城鄉",
      "玉里鎮",
      "瑞穗鄉",
      "秀林鄉",
      "花蓮市",
      "萬榮鄉",
      "豐濱鄉",
      "鳳林鎮"
    ]
  },
  "台東縣": {
    "name": "台東縣",
    "districts": [
      "卑南鄉",
      "台東市",
      "大武鄉",
      "太麻里鄉",
      "延平鄉",
      "成功鎮",
      "東河鄉",
      "池上鄉",
      "海端鄉",
      "綠島鄉",
      "蘭嶼鄉",
      "達仁鄉",
      "金峰鄉",
      "長濱鄉",
      "關山鎮",
      "鹿野鄉"
    ]
  },
  "澎湖縣": {
    "name": "澎湖縣",
    "districts": [
      "七美鄉",
      "望安鄉",
      "湖西鄉",
      "白沙鄉",
      "西嶼鄉",
      "馬公市"
    ]
  },
  "金門縣": {
    "name": "金門縣",
    "districts": [
      "烈嶼鄉",
      "烏坵鄉",
      "金城鎮",
      "金寧鄉",
      "金沙鎮",
      "金湖鎮"
    ]
  },
  "連江縣": {
    "name": "連江縣",
    "districts": [
      "北竿鄉",
      "南竿鄉",
      "東引鄉",
      "莒光鄉"
    ]
  },
  "南海諸島": {
    "name": "南海諸島",
    "districts": [
      "南沙",
      "東沙"
    ]
  }
};

// 顯示縣市選單
function cityTown() {
  for (var i in cities) {
    $('#city').append(`<option value="${cities[i].name}">${cities[i].name}</option>`);
  }
}

var table;
// 建立table與設定
function showResultTable (answer) {
  table = $('#result').DataTable({
    data: answer,
    searching: false,
    ordering:  false,
    select: false,
    lengthChange: false,
    info: false,
    autoWidth: false,
    pagingType: 'simple_numbers',
    language: {
      paginate: {
        previous: '上一頁',
        next: '下一頁',
      },
      emptyTable: '您查詢的區域尚無推薦資料',
    },
    columns: [
      {data: 'name'},
      {data: 'phone'},
      {data: 'address'},
      {data: 'info'},
    ]
  });
  $('.show_result').show();
}

$(document)
  .ready(function () {
    var answer = [];
    for (var i in hospitals) {
        var item = hospitals[i];
        answer.push({
            name: item.name,
            phone: item.phone,
            address: item.address,
            info: item.info,
        });
    }
    showResultTable(answer);
    cityTown();
    // Smooth scrolling using jQuery easing
    $('a.smooth-scroll[href*="#"]:not([href="#"])').click(function () {
      if (location.pathname.replace(/^\//, '') == this.pathname.replace(/^\//, '') && location.hostname == this.hostname) {
        var target = $(this.hash);
        target = target.length ? target : $('[name=' + this.hash.slice(1) + ']');
        if (target.length) {
          let headerOffset = 56;
          if ( width >=  992 ) {
            headerOffset = 70;
          } else {
            headerOffset = 56;
          }
          $('html, body').animate({
            scrollTop: (target.offset().top - headerOffset)
          }, 1000);
          // return false;
        }
      }
    });
  })
  // 選擇縣市時更新鄉鎮選單
  .on('change', '#city', function () {
    var city = $(this).val();
    var districts = cities[city].districts;
    $('#area').html('<option value="" selected>選擇區域</option>');
    for (var i in districts) {
      $('#area').append(`<option value="${districts[i]}">${districts[i]}</option>`);
    }
  })
  // search
  .on('click', '#gosearch', function (e) {
    e.preventDefault();
    var city = $('#city').val();
    var area = $('#area').val();
    var info = $('#info').val();
    var search_name = $('#search_name').val();
    if (city == "" && area == "" && info.length == 0 && search_name.length == 0) {
      return;
    }
    if (table) {
      table.destroy();
    }
    var answer = [];
    for (var i in hospitals) {
      var item = hospitals[i];
      // 有選擇時，物件內容是否符合
      if (city !== "" && item.city !== city) {
        continue;
      }
      if (area !== "" && item.town !== area) {
        continue;
      }

      if (info.length > 0 && item.info.indexOf(info) == -1) {
        continue;
      }

      if (search_name.length > 0 && item.name.indexOf(search_name) == -1) {
        continue;
      }

      answer.push({
        name: item.name,
        phone: item.phone,
        address: item.address,
        info: item.info
      });
    }

    // 生成table
    showResultTable(answer);
  })

